#### FamilyUtils Members

---

|  |
| --- |
| FamilyUtils Class   Methods   See Also |

The  FamilyUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConvertFamilyToFaceHostBased | Converts a family to be face host based. |
| Public method Static member | FamilyCanConvertToFaceHostBased | Indicates whether the family can be converted to face host based. |
| Public method Static member | GetProfileSymbols | Gets the profile Family Symbols of the document. |

# See Also

FamilyUtils Class

Autodesk.Revit.DB Namespace